LeeKyuHyuk/rp2040-emulator/test/rp2040_test.cpp
#include "rp2040.h"
#include "utils/assembler.h"
#include "gtest/gtest.h"

#define R0 0
#define R1 1
#define R2 2
#define R3 3
#define R4 4
#define R5 5
#define R6 6
#define R7 7
#define R8 8
#define IP 12
#define SP 13
#define LR 14
#define PC 15

const number VTOR = 0xe000ed08;

// should initialize PC and SP according to bootrom's vector table
TEST(boot_rom_initialize, RP2040) {
  RP2040 *rp2040 = new RP2040();
  const uint32_t bootrom[2] = {0x20041f00, 0xee};
  rp2040->loadBootrom(bootrom, 2);
  EXPECT_EQ(rp2040->getSP(), 0x20041f00);
  EXPECT_EQ(rp2040->getPC(), 0xEE);
}

// should execute a `pop pc, {r4, r5, r6}` instruction
TEST(execute_pop_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(RAM_START_ADDRESS + 0xf0);
  rp2040->flash16[0] = opcodePOP(true, (1 << R4) | (1 << R5) | (1 << R6));
  rp2040->sram[0xf0] = 0x40;
  rp2040->sram[0xf4] = 0x50;
  rp2040->sram[0xf8] = 0x60;
  rp2040->sram[0xfc] = 0x42;
  rp2040->executeInstruction();
  // assert that the values of r4, r5, r6, lr were pushed into the stack
  EXPECT_EQ(rp2040->registers[R4], 0x40);
  EXPECT_EQ(rp2040->registers[R5], 0x50);
  EXPECT_EQ(rp2040->registers[R6], 0x60);
  EXPECT_EQ(rp2040->getPC(), 0x42);
}

// should execute a `push {r4, r5, r6, lr}` instruction
TEST(execute_push_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(RAM_START_ADDRESS + 0x100);
  rp2040->flash16[0] = 0xB570; // push {r4, r5, r6, lr}
  EXPECT_EQ(rp2040->flash[0], 0x70);
  EXPECT_EQ(rp2040->flash[1], 0xB5);
  rp2040->registers[R4] = 0x40;
  rp2040->registers[R5] = 0x50;
  rp2040->registers[R6] = 0x60;
  rp2040->setLR(0x42);
  rp2040->executeInstruction();
  // assert that the values of r4, r5, r6, lr were pushed into the stack
  EXPECT_EQ(rp2040->getSP(), RAM_START_ADDRESS + 0xF0);
  EXPECT_EQ(rp2040->sram[0xF0], 0x40);
  EXPECT_EQ(rp2040->sram[0xF4], 0x50);
  EXPECT_EQ(rp2040->sram[0xF8], 0x60);
  EXPECT_EQ(rp2040->sram[0xFC], 0x42);
}

// should execute a `mrs r0, ipsr` instruction
TEST(execute_mrs_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flashView->setUint32(0, opcodeMRS(R0, 5)); // 5 === ipsr
  rp2040->registers[R0] = 55;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R0], 0);
  EXPECT_EQ(rp2040->getPC(), 0x10000004);
}

// should execute a `msr ipsr, r0` instruction
TEST(execute_msr_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flashView->setUint32(0, opcodeMSR(8, R0)); // 5 === ipsr
  rp2040->registers[0] = 0x1234;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getSP(), 0x1234);
  EXPECT_EQ(rp2040->getPC(), 0x10000004);
}

// should execute a `movs r5, #128` instruction
TEST(execute_mov_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMOVS(R5, 128);
  EXPECT_EQ(rp2040->flash[0], 0x80);
  EXPECT_EQ(rp2040->flash[1], 0x25);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 128);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

// should execute a `lsrs r1, r1, #1` instruction
TEST(execute_lsrs_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLSRS(R1, R1, 1);
  rp2040->registers[R1] = 0b10;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 0b1);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->C, false);
}

// should execute a `lsrs r1, r1, 0` instruction
TEST(execute_lsrs_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLSRS(R1, R1, 0);
  rp2040->registers[R1] = 0xffffffff;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 0);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->C, true);
}

// should execute a `lsrs r5, r0` instruction
TEST(execute_lsrs_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLSRSreg(R5, R0);
  rp2040->registers[R5] = 0xff00000f;
  rp2040->registers[R0] = 0xff003302; // Shift amount: 02
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0x3fc00003);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->C, true);
}

// should execute a `movs r6, r5` instruction
TEST(execute_mov_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x002E; // movs r6, r5
  rp2040->registers[R5] = 0x50;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R6], 0x50);
}

// should execute an `eors r1, r3` instruction
TEST(execute_eors_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeEORS(R1, R3);
  rp2040->registers[R1] = 0xf0f0f0f0;
  rp2040->registers[R3] = 0x08ff3007;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 0xf80fc0f7);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
}

// should execute a `mov r3, r8` instruction
TEST(execute_mov_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMOV(R3, R8);
  rp2040->registers[R8] = 55;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 55);
}

// should execute a `mov r3, pc` instruction
TEST(execute_mov_instruction_4, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMOV(R3, PC);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x10000004);
}

// should execute a `muls r0, r2` instruction
TEST(execute_muls_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMULS(R0, R2);
  rp2040->registers[R0] = 5;
  rp2040->registers[R2] = 1000000;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R2], 5000000);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
}

// should execute a `muls r0, r2` instruction and
// set the Z flag when the result is zero
TEST(execute_muls_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMULS(R0, R2);
  rp2040->registers[R0] = 0;
  rp2040->registers[R2] = 1000000;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R2], 0);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, true);
}

// should execute a `muls r0, r2` instruction and
// set the N flag when the result is negative
TEST(execute_muls_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMULS(R0, R2);
  rp2040->registers[R0] = -1;
  rp2040->registers[R2] = 1000000;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R2], (uint32_t)-1000000 >> 0);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
}

