LeeKyuHyuk/rp2040-emulator/test/rp2040_test.cpp
// should execute a muls instruction with
// large 32-bit numbers and produce the correct result
TEST(execute_muls_instruction_4, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMULS(R0, R2);
  rp2040->registers[R0] = 2654435769;
  rp2040->registers[R2] = 340573321;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R2], 1);
}

// should execute a `mvns r4, r3` instruction
TEST(execute_mvns_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeMVNS(R4, R3);
  rp2040->registers[R3] = 0x11115555;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R4], 0xeeeeaaaa);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->N, true);
}

// should execute `orrs r5, r0` instruction
TEST(execute_orrs_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeORRS(R5, R0);
  rp2040->registers[R5] = 0xf00f0000;
  rp2040->registers[R0] = 0xf000ffff;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0xf00fffff);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
}

// should execute a `ldmia r0!, {r1, r2}` instruction
TEST(execute_ldmia_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDMIA(R0, (1 << R1) | (1 << R2));
  rp2040->registers[R0] = 0x20000000;
  uint32_t *sram32 = (uint32_t *)rp2040->sram;
  sram32[0] = 0xf00df00d;
  sram32[1] = 0x4242;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->registers[R0], 0x20000008);
  EXPECT_EQ(rp2040->registers[R1], 0xf00df00d);
  EXPECT_EQ(rp2040->registers[R2], 0x4242);
}

// should execute a `ldmia r5!, {r5}` instruction
// without writing back the address to r5
TEST(execute_ldmia_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDMIA(R5, 1 << R5);
  rp2040->registers[R5] = 0x20000000;
  uint32_t *sram32 = (uint32_t *)rp2040->sram;
  sram32[0] = 0xf00df00d;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->registers[R5], 0xf00df00d);
}

// should execute an `ldr r0, [pc, #148]` instruction
TEST(execute_ldr_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x4825; // ldr r0, [pc, #148]
  rp2040->flash[152] = 0x42;
  memset(&rp2040->flash[153], 0x00, sizeof(uint32_t));
  rp2040->executeInstruction();
  rp2040->registers[R5] = 0x50;
  EXPECT_EQ(rp2040->registers[R0], 0x42);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

// should execute an `ldr r3, [r2, #24]` instruction
TEST(execute_ldr_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x6993; // ldr r3, [r2, #24]
  rp2040->registers[R2] = 0x20000000;
  rp2040->sram[24] = 0x55;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x55);
}

// should execute an `ldr r3, [r5, r6]` instruction
TEST(execute_ldr_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRreg(R3, R5, R6);
  rp2040->registers[R5] = 0x20000000;
  rp2040->registers[R6] = 0x8;
  rp2040->sram[8] = 0x11;
  rp2040->sram[9] = 0x42;
  rp2040->sram[10] = 0x55;
  rp2040->sram[11] = 0xff;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0xff554211);
}

// should execute an `ldr r3, [sp, #12]` instruction
TEST(execute_ldr_instruction_4, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(0x20000000);
  rp2040->flash16[0] = opcodeLDRsp(R3, 12);
  rp2040->sram[12] = 0x55;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x55);
}

// should execute an `ldrb r4, [r2, 5]` instruction
TEST(execute_ldrb_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRB(R4, R2, 5);
  rp2040->registers[R2] = 0x20000000;
  rp2040->sram[5] = 0x66;
  rp2040->sram[6] = 0x77;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R4], 0x66);
}

// should execute an `ldrb r3, [r5, r6]` instruction
TEST(execute_ldrb_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRBreg(R3, R5, R6);
  rp2040->registers[R5] = 0x20000000;
  rp2040->registers[R6] = 0x8;
  rp2040->sram[8] = 0x11;
  rp2040->sram[9] = 0x42;
  rp2040->sram[10] = 0x55;
  rp2040->sram[11] = 0xff;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x11);
}

// should execute an `ldrh r3, [r7, #4]` instruction
TEST(execute_ldrh_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRH(R3, R7, 4);
  rp2040->registers[R7] = 0x20000000;
  rp2040->sram[4] = 0x66;
  rp2040->sram[5] = 0x77;
  rp2040->sram[6] = 0xff;
  rp2040->sram[7] = 0xff;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x7766);
}

// should execute an `ldrh r3, [r7, #6]` instruction
TEST(execute_ldrh_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRH(R3, R7, 6);
  rp2040->registers[R7] = 0x20000000;
  rp2040->sram[4] = 0x66;
  rp2040->sram[5] = 0x77;
  rp2040->sram[6] = 0x44;
  rp2040->sram[7] = 0x33;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x3344);
}

// should execute an `ldrh r3, [r5, r6]` instruction
TEST(execute_ldrh_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRHreg(R3, R5, R6);
  rp2040->registers[R5] = 0x20000000;
  rp2040->registers[R6] = 0x8;
  rp2040->sram[8] = 0x11;
  rp2040->sram[9] = 0x42;
  rp2040->sram[10] = 0x55;
  rp2040->sram[11] = 0xff;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x4211);
}

// should execute an `ldrsb r5, [r3, r5]` instruction
TEST(execute_ldrsb_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRSB(R5, R3, R5);
  rp2040->registers[R3] = 0x20000000;
  rp2040->registers[R5] = 6;
  rp2040->sram[6] = 0x85;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0xffffff85);
}

// should execute an `ldrsh r5, [r3, r5]` instruction
TEST(execute_ldrsh_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLDRSH(R5, R3, R5);
  rp2040->registers[R3] = 0x20000000;
  rp2040->registers[R5] = 0x6;
  rp2040->sram[6] = 0x55;
  rp2040->sram[7] = 0xF0;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0xfffff055);
}

// should execute a `udf 1` instruction
TEST(execute_udf_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0xde01; // udf 1
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->getBreakCount(), 1);
}

// should execute a `lsls r5, r5, #18` instruction
TEST(execute_lsls_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x04AD; // lsls r5, r5, #18
  rp2040->registers[R5] = 0b00000000000000000011;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0b11000000000000000000);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->C, false);
}

// should execute a `lsls r5, r0` instruction
TEST(execute_lsls_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeLSLSreg(R5, R0);
  rp2040->registers[R5] = 0b00000000000000000011;
  rp2040->registers[R0] = 0xff003302; // bottom byte: 02
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0b00000000000000001100);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->C, false);
}

// should execute a `lsls r5, r5, #18` instruction with carry
TEST(execute_lsls_instruction_with_carry, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x04AD; // lsls r5, r5, #18
  rp2040->registers[R5] = 0x00004001;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0x40000);
  EXPECT_EQ(rp2040->C, true);
}

// should execute a `rev r3, r1` instruction
TEST(execute_rev_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeREV(R2, R3);
  rp2040->registers[R3] = 0x11223344;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R2], 0x44332211);
}

// should execute a `rsbs r0, r3` instruction
TEST(execute_rsbs_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeRSBS(R0, R3);
  rp2040->registers[R3] = 100;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R0] | 0, -100);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, false);
}

// should execute a `rsbs r0, r3` instruction
TEST(execute_rsbs_instruction_2, executeInstruction) {
  // This instruction is also called `negs`
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeRSBS(R0, R3);
  rp2040->registers[R3] = 0;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R0] | 0, 0);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, true);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, false);
}

// should execute a `sbcs r0, r3` instruction
TEST(execute_sbcs_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSBCS(R0, R3);
  rp2040->registers[R0] = 100;
  rp2040->registers[R3] = 55;
  rp2040->C = false;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R0], 44);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, false);
}

// should execute a `sdmia r0!, {r1, r2}` instruction
TEST(execute_sdmia_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSTMIA(R0, (1 << R1) | (1 << R2));
  rp2040->registers[R0] = 0x20000000;
  rp2040->registers[R1] = 0xf00df00d;
  rp2040->registers[R2] = 0x4242;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->registers[R0], 0x20000008);
  uint32_t *sram32 = (uint32_t *)rp2040->sram;
  EXPECT_EQ(sram32[0], 0xf00df00d);
  EXPECT_EQ(sram32[1], 0x4242);
}

// should execute a `str r6, [r4, #20]` instruction
TEST(execute_str_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSTR(R6, R4, 20);
  rp2040->registers[R4] = RAM_START_ADDRESS + 0x20;
  rp2040->registers[R6] = 0xF00D;
  rp2040->executeInstruction();
  uint32_t value;
  memcpy(&value, &(rp2040->sram[0x20 + 20]), sizeof(uint32_t));
  EXPECT_EQ(value, 0xF00D);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

