LeeKyuHyuk/rp2040-emulator/test/rp2040_test.cpp
// should execute a `str r6, [r4, r5]` instruction
TEST(execute_str_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSTRreg(R6, R4, R5);
  rp2040->registers[R4] = RAM_START_ADDRESS + 0x20;
  rp2040->registers[R5] = 20;
  rp2040->registers[R6] = 0xF00D;
  rp2040->executeInstruction();
  uint32_t value;
  memcpy(&value, &(rp2040->sram[0x20 + 20]), sizeof(uint32_t));
  EXPECT_EQ(value, 0xF00D);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

// should execute an `str r3, [sp, #12]` instruction
TEST(execute_str_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(0x20000000);
  rp2040->flash16[0] = opcodeSTRsp(R3, 12);
  rp2040->registers[R3] = 0xaa55;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->sram[12], 0x55);
  EXPECT_EQ(rp2040->sram[13], 0xaa);
}

// should execute `bl 0x34` instruction
TEST(execute_bl_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  uint32_t *flash32 = (uint32_t *)rp2040->flash;
  flash32[0] = opcodeBL(0x34);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000038);
  EXPECT_EQ(rp2040->getLR(), 0x10000005);
}

// should execute `bl -0x10` instruction
TEST(execute_bl_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  uint32_t *flash32 = (uint32_t *)rp2040->flash;
  flash32[0] = opcodeBL(-0x10);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000004 - 0x10);
  EXPECT_EQ(rp2040->getLR(), 0x10000005);
}

// should execute `bl -3242` instruction
TEST(execute_bl_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  uint32_t *flash32 = (uint32_t *)rp2040->flash;
  flash32[0] = opcodeBL(-3242);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000004 - 3242);
  EXPECT_EQ(rp2040->getLR(), 0x10000005);
}

// should execute `blx r3` instruction
TEST(execute_blx_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->registers[R3] = 0x10000201;
  uint32_t *flash32 = (uint32_t *)rp2040->flash;
  flash32[0] = opcodeBLX(R3);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000200);
  EXPECT_EQ(rp2040->getLR(), 0x10000003);
}

// should execute a `b.n .-20` instruction
TEST(execute_bn_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000 + 0x9 * 0x2);
  rp2040->flash16[9] = 0xe7f6; // b.n .-20
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

// should execute a `bne.n .-6` instruction
TEST(execute_bnen_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000 + 0x9 * 0x2);
  rp2040->Z = false;
  rp2040->flash16[9] = 0xD1FC; // bne.n .-6
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x1000000E);
}

// should execute `bx lr` instruction
TEST(execute_bx_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setLR(0x10000200);
  uint32_t *flash32 = (uint32_t *)rp2040->flash;
  flash32[0] = opcodeBX(LR);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000200);
}

// should execute an `cmp r5, #66` instruction
TEST(execute_cmp_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x2D42; // cmp r5, #66
  rp2040->registers[R5] = 60;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, false);
}

// should execute an `cmp r5, r0` instruction
TEST(execute_cmp_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x4285; // cmp r5, r0
  rp2040->registers[R5] = 60;
  rp2040->registers[R0] = 56;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, false);
}

// should execute an `cmp ip, r6` instruction
TEST(execute_cmp_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x45b4; // cmp ip (r12), r6
  rp2040->registers[IP] = 60;
  rp2040->registers[R6] = 56;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, false);
}

// should execute a `subs r5, #10` instruction
TEST(execute_subs_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSUBS2(R5, 10);
  rp2040->registers[R5] = 100;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 90);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, false);
}

// should execute a `subs r1, #1` instruction with overflow
TEST(execute_subs_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSUBS2(R1, 1);
  rp2040->registers[R1] = -0x80000000;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 0x7fffffff);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, true);
}

// should execute a `strb r6, [r4, #20]` instruction
TEST(execute_strb_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->sram[0x20] = 0xF2;
  rp2040->sram[0x21] = 0xF3;
  rp2040->sram[0x22] = 0xF4;
  rp2040->sram[0x23] = 0xF5;
  rp2040->flash16[0] = opcodeSTRB(R6, R4, 0x1);
  rp2040->registers[R4] = RAM_START_ADDRESS + 0x20;
  rp2040->registers[R6] = 0xf055;
  rp2040->executeInstruction();
  // assert that the 2nd byte (at 0x21) changed to 0x55
  EXPECT_EQ(rp2040->sram[0x20], 0xF2);
  EXPECT_EQ(rp2040->sram[0x21], 0x55);
  EXPECT_EQ(rp2040->sram[0x22], 0xF4);
  EXPECT_EQ(rp2040->sram[0x23], 0xF5);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

// should execute a `strb r6, [r4, r5]` instruction
TEST(execute_strb_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->sram[0x20] = 0xF2;
  rp2040->sram[0x21] = 0xF3;
  rp2040->sram[0x22] = 0xF4;
  rp2040->sram[0x23] = 0xF5;
  rp2040->flash16[0] = opcodeSTRBreg(R6, R4, R5);
  rp2040->registers[R4] = RAM_START_ADDRESS + 0x20;
  rp2040->registers[R5] = 0x1;
  rp2040->registers[R6] = 0xf055;
  rp2040->executeInstruction();
  // assert that the 2nd byte (at 0x21) changed to 0x55
  EXPECT_EQ(rp2040->sram[0x20], 0xF2);
  EXPECT_EQ(rp2040->sram[0x21], 0x55);
  EXPECT_EQ(rp2040->sram[0x22], 0xF4);
  EXPECT_EQ(rp2040->sram[0x23], 0xF5);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

// should execute a `strh r6, [r4, #20]` instruction
TEST(execute_strh_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->sram[0x20] = 0xF2;
  rp2040->sram[0x21] = 0xF3;
  rp2040->sram[0x22] = 0xF4;
  rp2040->sram[0x23] = 0xF5;
  rp2040->flash16[0] = opcodeSTRH(R6, R4, 0x2);
  rp2040->registers[R4] = RAM_START_ADDRESS + 0x20;
  rp2040->registers[R6] = 0x6655;
  rp2040->executeInstruction();
  // assert that the 3rd/4th byte (at 0x22) changed to 0x6655
  EXPECT_EQ(rp2040->sram[0x20], 0xF2);
  EXPECT_EQ(rp2040->sram[0x21], 0xF3);
  EXPECT_EQ(rp2040->sram[0x22], 0x55);
  EXPECT_EQ(rp2040->sram[0x23], 0x66);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

