LeeKyuHyuk/rp2040-emulator/test/rp2040_test.cpp
// should execute a `strh r6, [r4, r1]` instruction
TEST(execute_strh_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->sram[0x20] = 0xF2;
  rp2040->sram[0x21] = 0xF3;
  rp2040->sram[0x22] = 0xF4;
  rp2040->sram[0x23] = 0xF5;
  rp2040->flash16[0] = opcodeSTRHreg(R6, R4, R1);
  rp2040->registers[R4] = RAM_START_ADDRESS + 0x20;
  rp2040->registers[R1] = 0x2;
  rp2040->registers[R6] = 0x6655;
  rp2040->executeInstruction();
  // assert that the 3rd/4th byte (at 0x22) changed to 0x6655
  EXPECT_EQ(rp2040->sram[0x20], 0xF2);
  EXPECT_EQ(rp2040->sram[0x21], 0xF3);
  EXPECT_EQ(rp2040->sram[0x22], 0x55);
  EXPECT_EQ(rp2040->sram[0x23], 0x66);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
}

// should execute a `sub sp, 0x10` instruction
TEST(execute_subs_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(0x10000040);
  rp2040->flash16[0] = opcodeSUBsp(0x10);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getSP(), 0x10000030);
}

// should execute a `subs r5, r3, 5` instruction
TEST(execute_subs_instruction_4, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSUBS1(R5, R3, 5);
  rp2040->registers[R3] = 0;
  rp2040->executeInstruction();
  EXPECT_EQ((int)rp2040->registers[R5] | 0, -5);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, false);
}

// should execute a `subs r5, r3, r2` instruction
TEST(execute_subs_instruction_5, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSUBSreg(R5, R3, R2);
  rp2040->registers[R3] = 6;
  rp2040->registers[R2] = 5;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 1);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, false);
}

// should raise an SVCALL exception when `svc` instruction runs
TEST(execute_svc_instruction, executeInstruction) {
  const number SVCALL_HANDLER = 0x10002000;
  RP2040 *rp2040 = new RP2040();
  rp2040->setSP(0x20004000);
  rp2040->setPC(0x10004000);
  rp2040->writeUint16(0x10004000, opcodeSVC(10));
  rp2040->registers[R0] = 0x44;
  rp2040->writeUint32(VTOR, 0x10040000);
  rp2040->writeUint32(0x10040000 + EXC_SVCALL * 4, SVCALL_HANDLER);
  rp2040->writeUint16(SVCALL_HANDLER, opcodeMOVS(R0, 0x55));

  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->pendingSVCall, true);

  rp2040->executeInstruction(); // SVCall handler should run here
  EXPECT_EQ(rp2040->pendingSVCall, false);
  EXPECT_EQ(rp2040->getPC(), SVCALL_HANDLER + 2);
  EXPECT_EQ(rp2040->registers[R0], 0x55);
}

// should execute a `sxtb r2, r2` instruction with sign bit 1
TEST(execute_sxtb_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSXTB(R2, R2);
  rp2040->registers[R2] = 0x22446688;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R2], 0xffffff88);
}

// should execute a `sxtb r2, r2` instruction with sign bit 0
TEST(execute_sxtb_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeSXTB(R2, R2);
  rp2040->registers[R2] = 0x12345678;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R2], 0x78);
}

// should execute an `tst r1, r3` instruction when the result is negative
TEST(execute_tst_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x4219; // tst r1, r3
  rp2040->registers[R1] = 0xF0000000;
  rp2040->registers[R3] = 0xF0004000;
  rp2040->sram[24] = 0x55;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->N, true);
}

// should execute an `tst r1, r3` instruction when the registers are equal
TEST(execute_tst_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = 0x4219; // tst r1, r3
  rp2040->registers[R1] = 0x00;
  rp2040->registers[R3] = 0x37;
  rp2040->sram[24] = 0x55;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->Z, true);
}

// should execute `adcs r5, r4` instruction
TEST(execute_adcs_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADCS(R5, R4);
  rp2040->registers[R4] = 55;
  rp2040->registers[R5] = 66;
  rp2040->C = true;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 122);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, false);
}

// should execute `adcs r5, r4` instruction
TEST(execute_adcs_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADCS(R5, R4);
  rp2040->registers[R4] = 0x7FFFFFFF; // Max signed INT32
  rp2040->registers[R5] = 0;
  rp2040->C = true;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0x80000000);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, true);
}

// should execute a `add sp, 0x10` instruction
TEST(execute_add_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(0x10000040);
  rp2040->flash16[0] = opcodeADDsp2(0x10);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getSP(), 0x10000050);
}

// should execute `add r1, ip` instruction
TEST(execute_add_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADDreg(R1, IP);
  rp2040->registers[R1] = 66;
  rp2040->registers[IP] = 44;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 110);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, false);
}

// should execute `add sp, r8` instruction and not update the flags
TEST(execute_add_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(0x20030000);
  rp2040->Z = true;
  rp2040->flash16[0] = opcodeADDreg(SP, R8);
  rp2040->registers[R8] = 0x11;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getSP(), 0x20030011);
  EXPECT_EQ(rp2040->Z, true); // assert it didn't update the flags
}

