LeeKyuHyuk/rp2040-emulator/test/rp2040_test.cpp
// should execute `add pc, r8` instruction
TEST(execute_add_instruction_4, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADDreg(PC, R8);
  rp2040->registers[R8] = 0x11;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getPC(), 0x10000014);
}

// should execute a `add r1, sp, #4` instruction
TEST(execute_add_instruction_5, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->setSP(0x55);
  rp2040->flash16[0] = opcodeADDspPlusImm(R1, 0x10);
  rp2040->registers[R1] = 0;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->getSP(), 0x55);
  EXPECT_EQ(rp2040->registers[R1], 0x65);
}

// should execute `adds r1, #1` instruction
TEST(execute_adds_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADDS2(R1, 1);
  rp2040->registers[R1] = 0xFFFFFFFF;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 0);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, true);
  EXPECT_EQ(rp2040->C, true);
  EXPECT_EQ(rp2040->V, false);
}

// should execute `adds r1, #1` instruction and
// set the overflow flag correctly
TEST(execute_adds_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADDS2(R1, 1);
  rp2040->registers[R1] = 0x7FFFFFFF;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 0x80000000);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, true);
}

// should execute `adds r1, r2, #3` instruction
TEST(execute_adds_instruction_3, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADDS1(R1, R2, 3);
  rp2040->registers[R2] = 2;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 5);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, false);
}

// should execute `adds r1, r2, r7` instruction
TEST(execute_adds_instruction_4, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADDSreg(R1, R2, R7);
  rp2040->registers[R2] = 2;
  rp2040->registers[R7] = 27;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R1], 29);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
  EXPECT_EQ(rp2040->V, false);
}

// should execute `adr r4, #0x50` instruction and
// set the overflow flag correctly
TEST(execute_adr_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeADR(R4, 0x50);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R4], 0x10000054);
}

// should execute `ands r5, r0` instruction
TEST(execute_ands_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeANDS(R5, R0);
  rp2040->registers[R5] = 0xffff0000;
  rp2040->registers[R0] = 0xf00fffff;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0xf00f0000);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
}

// should execute an `asrs r3, r2, #31` instruction
TEST(execute_asrs_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeASRS(R3, R2, 31);
  rp2040->registers[R2] = 0x80000000;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0xffffffff);
  EXPECT_EQ(rp2040->getPC(), 0x10000002);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
  EXPECT_EQ(rp2040->C, false);
}

// should execute `bics r0, r3` correctly
TEST(execute_bics_instruction_1, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->registers[R0] = 0xff;
  rp2040->registers[R3] = 0x0f;
  rp2040->flash16[0] = opcodeBICS(R0, R3);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R0], 0xF0);
  EXPECT_EQ(rp2040->N, false);
  EXPECT_EQ(rp2040->Z, false);
}

// should execute `bics r0, r3` instruction
// and set the negative flag correctly
TEST(execute_bics_instruction_2, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->registers[R0] = 0xffffffff;
  rp2040->registers[R3] = 0x0000ffff;
  rp2040->flash16[0] = opcodeBICS(R0, R3);
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R0], 0xffff0000);
  EXPECT_EQ(rp2040->N, true);
  EXPECT_EQ(rp2040->Z, false);
}

// should execute an `uxtb r5, r3` instruction
TEST(execute_uxtb_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeUXTB(R5, R3);
  rp2040->registers[R3] = 0x12345678;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R5], 0x78);
}

// should execute an `uxth r3, r1` instruction
TEST(execute_uxth_instruction, executeInstruction) {
  RP2040 *rp2040 = new RP2040();
  rp2040->setPC(0x10000000);
  rp2040->flash16[0] = opcodeUXTH(R3, R1);
  rp2040->registers[R1] = 0x12345678;
  rp2040->executeInstruction();
  EXPECT_EQ(rp2040->registers[R3], 0x5678);
}

// writing to NVIC_ISPR should set the corresponding pending interrupt bits
TEST(nvic_ispr, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  rp2040->pendingInterrupts = 0x1;
  rp2040->writeUint32(0xe000e200, 0x10);
  EXPECT_EQ(rp2040->pendingInterrupts, 0x11);
}

// writing to NVIC_ICPR should clear corresponding pending interrupt bits
TEST(nvic_icpr, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  rp2040->pendingInterrupts = 0xff;
  rp2040->writeUint32(0xe000e280, 0x10);
  EXPECT_EQ(rp2040->pendingInterrupts, 0xef);
}

// writing to NVIC_ISER should set the corresponding enabled interrupt bits
TEST(nvic_iser, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  rp2040->pendingInterrupts = 0x1;
  rp2040->writeUint32(0xe000e100, 0x10);
  EXPECT_EQ(rp2040->pendingInterrupts, 0x11);
}

// writing to NVIC_ICER should clear corresponding enabled interrupt bits
TEST(nvic_icer, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  rp2040->pendingInterrupts = 0x1;
  rp2040->writeUint32(0xe000e180, 0x10);
  EXPECT_EQ(rp2040->pendingInterrupts, 0xef);
}

