LeeKyuHyuk/rp2040-emulator/test/rp2040_test.cpp
// reading from NVIC_ISER/NVIC_ICER should return
// the current enabled interrupt bits
TEST(nvic_iser_icer, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  rp2040->pendingInterrupts = 0x1;
  EXPECT_EQ(rp2040->readUint32(0xe000e100), 0x1);
  EXPECT_EQ(rp2040->readUint32(0xe000e180), 0x1);
}

// reading from NVIC_ISPR/NVIC_ICPR should return
// the current enabled interrupt bits
TEST(nvic_iser_icpr, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  rp2040->pendingInterrupts = 0x2;
  EXPECT_EQ(rp2040->readUint32(0xe000e200), 0x2);
  EXPECT_EQ(rp2040->readUint32(0xe000e280), 0x2);
}

// should update the interrupt levels correctly when writing to NVIC_IPR3
TEST(nvic_ipr3, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  // Set the priority of interrupt number 14 to 2
  rp2040->writeUint32(0xe000e40c, 0x00800000);
  EXPECT_EQ((int)rp2040->interruptPriorities[0], ~(1 << 14));
  EXPECT_EQ(rp2040->interruptPriorities[1], 0);
  EXPECT_EQ(rp2040->interruptPriorities[2], 1 << 14);
  EXPECT_EQ(rp2040->interruptPriorities[3], 0);
  EXPECT_EQ(rp2040->readUint32(0xe000e40c), 0x00800000);
}

// should return the correct interrupt priorities when reading from NVIC_IPR5
TEST(nvic_ipr5, nvicRegisters) {
  RP2040 *rp2040 = new RP2040();
  rp2040->interruptPriorities[0] = 0;
  rp2040->interruptPriorities[1] = 0x001fffff; // interrupts 0 ... 20
  rp2040->interruptPriorities[2] = 0x00200000; // interrupt 21
  rp2040->interruptPriorities[3] = 0xffc00000; // interrupt 22 ... 31
  // Set the priority of interrupt number 14 to 2
  EXPECT_EQ(rp2040->readUint32(0xe000e414), (int)0xc0c08040);
}

// should return the correct interrupt priorities when reading from NVIC_IPR5
TEST(exception_handler, exceptionEntry_and_exceptionReturn) {
  const number INT1 = 1 << 1;
  const number INT1_HANDLER = 0x10000100;
  const number EXC_INT1 = 16 + 1;
  RP2040 *rp2040 = new RP2040();
  rp2040->setSP(0x20004000);
  rp2040->setPC(0x10004000);
  rp2040->registers[R0] = 0x44;
  rp2040->pendingInterrupts = INT1;
  rp2040->enabledInterrupts = INT1;
  rp2040->interruptsUpdated = true;
  rp2040->writeUint32(VTOR, 0x10000000);
  rp2040->writeUint32(0x10000000 + EXC_INT1 * 4, INT1_HANDLER);
  rp2040->writeUint16(INT1_HANDLER, opcodeMOVS(R0, 0x55));
  rp2040->writeUint16(INT1_HANDLER + 2, opcodeBX(LR));
  // Exception handler should start at this point.
  rp2040->executeInstruction(); // MOVS r0, 0x55
  EXPECT_EQ(rp2040->IPSR, EXC_INT1);
  EXPECT_EQ(rp2040->getPC(), INT1_HANDLER + 2);
  EXPECT_EQ(rp2040->registers[R0], 0x55);
  rp2040->executeInstruction(); // BX lr
  EXPECT_EQ(rp2040->getPC(), 0x10004000);
  EXPECT_EQ(rp2040->registers[R0], 0x44);
  EXPECT_EQ(rp2040->IPSR, 0);
}